In [28]:
import pandas as pd
df = pd.read_excel("7-4_stock_data.xlsx")
df
#I used the Excel file because the csv file included a sixth column.

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [29]:
df = pd.read_excel("7-4_stock_data.xlsx")
df

  stocks data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     tickers            eps    revenue      price         people
1       GOOGL          27.82         87        845     larry page
2         WMT           4.61        484         65           n.a.
3        MSFT             -1         85         64     bill gates
4        RIL   not available         50       1023  mukesh ambani
5        TATA            5.6         -1       n.a.     ratan tata

In [30]:
df = pd.read_excel("7-4_stock_data.xlsx", skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Use the syntax above to skip a row if necessary. Or use the syntax header=1 instead of skiprows=1.

In [31]:
df = pd.read_excel("7-4_stock_data.xlsx", header=None)
df

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3   RIL   not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In the example above, there are no headers in the Excel file, so the syntax header=None is used, and headers are automatically generated.

In [32]:
df = pd.read_excel("7-4_stock_data.xlsx", header=None, names=["ticker", "eps", "revenue", "price", "people"])
df

  ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3   RIL   not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

In the example above, the names are supplied by using names=[] as an argument.

In [33]:
df = pd.read_excel("7-4_stock_data.xlsx", nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

With nrows=3, the first three rows only are displayed.

In [34]:
df = pd.read_excel("7-4_stock_data.xlsx", na_values=["not available", "n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

The above example replaces the values "not available" and "n.a." with NaN (not a number).

In [41]:
df = pd.read_excel("7-4_stock_data.xlsx", na_values={
    "eps": ["not available", "n.a."],
    "revenue": ["not available", "n.a.", "-1"],
    "people": ["not available", "n.a."],
    })
df
#for some reason, -1 still shows up with the Excel file.

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65            NaN
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [42]:
df = pd.read_csv("7-4_stock_data.csv", na_values={
    "eps": ["not available", "n.a."],
    "revenue": ["not available", "n.a.", "-1"],
    "people": ["not available", "n.a."],
    })
df
#-1 is changed to NaN in the csv file, though.

  tickers    eps  revenue price         people  Unnamed: 5
0   GOOGL  27.82     87.0   845     larry page         NaN
1     WMT   4.61    484.0    65            NaN         NaN
2    MSFT  -1.00     85.0    64     bill gates         NaN
3     RIL    NaN     50.0  1023  mukesh ambani         NaN
4    TATA   5.60      NaN  n.a.     ratan tata         NaN

In [44]:
df.to_csv("new csv", index=False)

In [45]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people', 'Unnamed: 5'], dtype='object')

In [46]:
df.to_csv("new csv", columns=["tickers", "eps"])

This syntax writes only two columns to the csv file, tickers and eps.

In [47]:
df.to_csv("new csv", header=False)

This syntax skips the header when writing the csv file.

In [48]:
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [49]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return "sam walton"
    return cell
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1", converters = {
    "people": convert_people_cell
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

The converters function allows you to convert a value in the table. Here, "n.a." in people is converted to "sam walton."

In [50]:
df.to_excel("new.xlsx", sheet_name="stocks")

The syntax above lets you write to an Excel file. Here, I created a new file called new.xlsx with the sheet name "stocks."

In [51]:
df.to_excel("new.xlsx", sheet_name="stocks", startrow=1, startcol=2)

This syntax allows you to start your table in the first row and second column of an Excel sheet.

In [52]:
df.to_excel("new.xlsx", sheet_name="stocks", startrow=1, startcol=2, index=False)

This syntax gets ride of the useless index.

In [53]:
df_stocks = pd.DataFrame({
    "tickers": ["GOOGL", "WMT", "MSFT"],
    "price": [845, 65, 64],
    "pe": [30.37, 14.26, 30.97],
    "eps": [27.82, 4.61, 2.12]
})

df_weather = pd.DataFrame({
    "day": ["1/1/2017", "1/2/2017", "1/3/2017"],
    "temperature": [32,35,28],
    "event": ["Rain", "Sunny", "Snow"]
})

In [55]:
with pd.ExcelWriter("7-4_stocks_weather.xlsx") as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")

The syntax above creates an Excel file with one dataframe, "stocks," on one sheet, and another dataframe, "weather," on another sheet.